In [25]:
x= [n**+1 for n in range(5)]

In [29]:
import pandas as pd

In [35]:
data={
    "Apples":[102,500,250,75],
    "Grapes":[50,180,90,45]
}
df=pd.DataFrame(data)

In [36]:
df

   Apples  Grapes
0     102      50
1     500     180
2     250      90
3      75      45

In [37]:
df["Grapes"]

0     50
1    180
2     90
3     45
Name: Grapes, dtype: int64

In [6]:
df[["Grapes"]]  #<- It will gives the naswer in form of DataFrame

   Grapes
0      50
1     180
2      90
3      45

In [43]:
di = {
    "mangoes": [70,65,45,87],
    "bananas": [65,80,94,63],
    "apples": [75,85,35,17],
    "grapes": [30,25,65,97],
    "kiwi": [70,35,67,49],
    "pear": [52,67,46,96],
    "Orange": [98,32,45,37],
    "Strawberry": [10,25,18,91]
}
df=pd.DataFrame(di)

In [44]:
df

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Strawberry
0       70       65      75      30    70    52      98          10
1       65       80      85      25    35    67      32          25
2       45       94      35      65    67    46      45          18
3       87       63      17      97    49    96      37          91

# Row selection

In [ ]:
loc & iloc

In [50]:
df

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Strawberry
0       70       65      75      30    70    52      98          10
1       65       80      85      25    35    67      32          25
2       45       94      35      65    67    46      45          18
3       87       63      17      97    49    96      37          91

In [42]:
df.loc[3]  #<- It gives the value of 3rd row

mangoes      87
bananas      63
apples       17
grapes       97
kiwi         49
pear         96
Orange       37
Straberry    91
Name: 3, dtype: int64

In [46]:
#loc -> index name
df.loc[[3]]   #<- It gives the value of 3rd row in form of dictionary

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Strawberry
3       87       63      17      97    49    96      37          91

In [47]:
#iloc -> Index
df.iloc[3]

mangoes       87
bananas       63
apples        17
grapes        97
kiwi          49
pear          96
Orange        37
Strawberry    91
Name: 3, dtype: int64

In [52]:
di = {
    "mangoes": [70,65,45,87],
    "bananas": [65,80,94,63],
    "apples": [75,85,35,17],
    "grapes": [30,25,65,97],
    "kiwi": [70,35,67,49],
    "pear": [52,67,46,96],
    "Orange": [98,32,45,37],
    "Straberry": [10,25,18,91]
}

In [53]:

df=pd.DataFrame(di,index=["A","B","C","D"])

In [54]:
df

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
A       70       65      75      30    70    52      98         10
B       65       80      85      25    35    67      32         25
C       45       94      35      65    67    46      45         18
D       87       63      17      97    49    96      37         91

In [55]:
df.loc[["D"]]   #<- loc gives the values with the help of index name

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
D       87       63      17      97    49    96      37         91

In [56]:
df.iloc[[3]]  #<- iloc gives the value from the index number

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
D       87       63      17      97    49    96      37         91

In [22]:
df.loc[[3]]  #<- if you will try to give index number in loc, then it will give error Previously, it worked above bcoz at that time the row name was 0,1,2,3

KeyError: "None of [Int64Index([3], dtype='int64')] are in the [index]"

In [23]:
df.iloc[[3]]

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
D       87       63      17      97    49    96      37         91

In [24]:
df.iloc[[-1]]   #<- Data frame also supports minus indexing part

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
D       87       63      17      97    49    96      37         91

In [25]:
df.iloc[2:3]   #<- It also supports slicing in the row and the last number of row in range slice, will be ignored

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
C       45       94      35      65    67    46      45         18

In [62]:
df.loc["A":"D"] #<- loc can also slice the dataframe and it will take all the rows which are in slicing part, from "A" to "D"

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
A       70       65      75      30    70    52      98         10
B       65       80      85      25    35    67      32         25
C       45       94      35      65    67    46      45         18
D       87       63      17      97    49    96      37         91

#### You can't select the columns with the help of loc and iloc

# Row Addition

In [65]:
student_name={
    "Name" : ["Rahul","Rohit","Venkat","Sahil","Ankita"],
    "OS":[25,85,64,98,87],
    "DBMS" : [80,60,76,62,90]
}
df1=pd.DataFrame(student_name)

In [66]:
df1

     Name  OS  DBMS
0   Rahul  25    80
1   Rohit  85    60
2  Venkat  64    76
3   Sahil  98    62
4  Ankita  87    90

In [67]:
data2={"Name": "Robby",
      "OS" : 85.5,
      "DBMS":68 }

In [68]:
df1=df1.append(data2)

TypeError: Can only append a dict if ignore_index=True

In [70]:
#1st Method -> append()
df1=df1.append(data2,ignore_index=True)  #<- Here, you have to write ignore_index=True, then it will be work bcoz otherwise it will give an error. bcoz append function doesn't know that at which place, it have to add this row. So ,that's why you have to add ignore_index=True

In [76]:
new={
    "Name" : "Modi",
    "OS" : 36,
    "DBMS": 96
}

In [77]:
df1.append(new)

TypeError: Can only append a dict if ignore_index=True

In [79]:
df1.append(new,ignore_index=True)

     Name    OS  DBMS
0   Rahul  25.0    80
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4  Ankita  87.0    90
5   Robby  85.5    68
6    Modi  36.0    96

In [80]:
#2nd Method -> concat()  <-concatination
data3={"Name":"Peter","OS":98.5,"DBMS":76}

In [81]:
df2=pd.DataFrame(data3, index=[0])   #<- here, in data3 all are scalar values, not list. SO for making its DataFrame, you have to give index number

In [82]:
df2

    Name    OS  DBMS
0  Peter  98.5    76

In [50]:
pd.concat([df1,df2])  #<- if will write like this, then the index will be in last again came from the df2. SO for this issue, you have to write ignore_index=True

     Name    OS  DBMS
0   Rahul  25.0    80
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4  Ankita  87.0    90
5   Robby  85.5    68
0   Peter  98.5    76

In [51]:
pd.concat([df1,df2],ignore_index=True) #<- This is temporary method,it is not do it for permanent

     Name    OS  DBMS
0   Rahul  25.0    80
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4  Ankita  87.0    90
5   Robby  85.5    68
6   Peter  98.5    76

In [85]:
df1

     Name    OS  DBMS
0   Rahul  25.0    80
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4  Ankita  87.0    90
5   Robby  85.5    68

In [53]:
pd.concat([df1,df2],ignore_index=True,inplace=True) #<- this permanent method is not working in concat. for do this permamnent, you have to assign tha value in old DataFrame or the new one.

TypeError: concat() got an unexpected keyword argument 'inplace'

In [54]:
df1=pd.concat([df1,df2],ignore_index=True)

In [56]:
df1

     Name    OS  DBMS
0   Rahul  25.0    80
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4  Ankita  87.0    90
5   Robby  85.5    68
6   Peter  98.5    76

In [86]:
data4={"Name":"Spiderman","OS":95,"DBMS":100}

In [118]:
df4=pd.DataFrame(data4,index=[0])

In [119]:
df4

        Name  OS  DBMS
0  Spiderman  95   100

In [120]:
df1=pd.concat([df1,df4])

In [121]:
df1

        Name    OS  DBMS
0      Rahul  25.0    80
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4     Ankita  87.0    90
5      Robby  85.5    68
6  Spiderman  95.0   100
0  Spiderman  95.0   100

In [122]:
df1.iloc[[0]]  #<-It gives only the 1st row which index value is 0. It means the iloc function gives only the rows based on index value. It doesn't give all the same index number rows

    Name    OS  DBMS
0  Rahul  25.0    80

In [123]:
df1.loc[[0]]  #<- It gives all the values which index number is 0

        Name    OS  DBMS
0      Rahul  25.0    80
0  Spiderman  95.0   100

In [72]:
df1.loc[[4]]

     Name    OS  DBMS
4  Ankita  87.0    90

In [124]:
df1.loc[4]=["Steve",95,86]

In [125]:
df1

        Name    OS  DBMS
0      Rahul  25.0    80
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100
0  Spiderman  95.0   100

In [126]:
df1.loc[0]=["vision",100,100]

In [127]:
df1  #<- it will change all the values which index name is 0

        Name     OS  DBMS
0     vision  100.0   100
1      Rohit   85.0    60
2     Venkat   64.0    76
3      Sahil   98.0    62
4      Steve   95.0    86
5      Robby   85.5    68
6  Spiderman   95.0   100
0     vision  100.0   100

In [128]:
df1.iloc[0]=["Panther",89,96]  #<- it will change only first line, bcoz iloc change only selected index number row

In [129]:
df1

        Name     OS  DBMS
0    Panther   89.0    96
1      Rohit   85.0    60
2     Venkat   64.0    76
3      Sahil   98.0    62
4      Steve   95.0    86
5      Robby   85.5    68
6  Spiderman   95.0   100
0     vision  100.0   100

In [130]:
df1.iloc[5]=["Hulk",68,57,23] #<- it gives an error,bcoz the number of given rows values is 4, where as in dataset only 3 rows

ValueError: Must have equal len keys and value when setting with an iterable

In [84]:
df1.iloc[5]=["Hulk",60]  #<- it also gives an error, bcoz it hs given only 1 row value

ValueError: Must have equal len keys and value when setting with an iterable

# Row Deletion

In [ ]:
del,pop,drop

In [131]:
del df1.loc[5]   #<- del function is not working in row deletion

AttributeError: __delitem__

In [132]:
df1.pop(df1.loc[[6]])  #<- pop function is also not working in row deletion

ValueError: Boolean array expected for the condition, not object

In [90]:
df1.pop(6)

KeyError: 6

In [ ]:
Remember that, del and pop functions will be only applicable for column deletion. Not for row deletion. and drop function is appliable for every DataFraame

In [91]:
df1.pop(6)  #<- it will delete column number 6 if it was in the df1

KeyError: 6

In [138]:
df1

        Name    OS  DBMS
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100

In [139]:
df1.drop(6)  #<- this will delete the row of name 6 and it is temporary change

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68

In [94]:
df1.drop(0) #<- this will take all the index name 0 value from the DataFrame

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [95]:
df1.drop(8)

KeyError: '[8] not found in axis'

In [134]:
df1

        Name     OS  DBMS
0    Panther   89.0    96
1      Rohit   85.0    60
2     Venkat   64.0    76
3      Sahil   98.0    62
4      Steve   95.0    86
5      Robby   85.5    68
6  Spiderman   95.0   100
0     vision  100.0   100

In [135]:
df1.drop(0,inplace=True) #<- It will permanently deleteall row name = 0 values

In [136]:
df1

        Name    OS  DBMS
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100

    use of Pandas:-    
    1. Data Analysis - its like sort the inplaced data
    2. Data Exploration - Playing with the data or explore the data like how many rows, columns,null values inside the data 
    3. Data cleaning - remove all the null values
    4. Data Manipulation -Data Manipulation is the modification of information to make  it easier to read or more structured

In [ ]:
Remember that, In every table, every column has 1 and only 1 value in 1 row.

In [140]:
df1

        Name    OS  DBMS
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100

# Data Exploration

In [141]:
df

   mangoes  bananas  apples  grapes  kiwi  pear  Orange  Straberry
A       70       65      75      30    70    52      98         10
B       65       80      85      25    35    67      32         25
C       45       94      35      65    67    46      45         18
D       87       63      17      97    49    96      37         91

In [142]:
df1

        Name    OS  DBMS
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100

In [ ]:
df1 10 million  #Population in term of statistics
#Population- superset of all the Samples

In [ ]:
# if you have data table which has almost 10 million datapoints(rows), at that time it is hard to take starting some data easily. So for that work, head is used
head()  #<- By default this head is set to 5

In [143]:
#<- It shows total first 5 rows of df1
df1.head() # In the statistic form, this is known as the sample
#sample - subset of Population 
# we have to work in this sample and use all funcions here

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68

In [ ]:
tail()  #bottom

In [ ]:
# tail takes the value 5 by default

In [144]:
df1.tail() #<- It returns tha last 5 row values by default

        Name    OS  DBMS
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100

In [105]:
df1

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [146]:
df1.head(6)  #<- it gives first 2 rows of df1

        Name    OS  DBMS
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100

In [107]:
df1.tail(2)  #<- Last 2 records

    Name    OS  DBMS
5  Robby  85.5    68
6  Peter  98.5    76

In [108]:
df1.tail(20)  #<- if there is no 20 rows into the tablen also it will print all the rows as many as there in the tabe

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

 # dtypes

In [147]:
df1.dtypes   #<- it returns all the data types of table

Name     object
OS      float64
DBMS      int64
dtype: object

In [ ]:
empty    #<-it will return the values that if table is empty or not in boolean

In [110]:
df1.empty

False

In [ ]:
ndim  #print the dimension of the table

In [111]:
df1.ndim

2

In [ ]:
shape  #returns the number of tows and columns

In [112]:
df1

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [113]:
df1.shape

(6, 3)

In [ ]:
size   #it prints the total number of elements

In [115]:
df1

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [114]:
df1.size

18

In [ ]:
values  # it will returns all the values in the form of 2D

In [148]:
df1.values

array([['Rohit', 85.0, 60],
       ['Venkat', 64.0, 76],
       ['Sahil', 98.0, 62],
       ['Steve', 95.0, 86],
       ['Robby', 85.5, 68],
       ['Spiderman', 95.0, 100]], dtype=object)

In [ ]:
keys  #it returns the whole table with the name of every rows

In [117]:
df1.keys

<bound method NDFrame.keys of      Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76>

In [ ]:
describe  # one of the most importat function

In [149]:
df1.describe()   #it gives all the important details of data table  
#count -> the total number of raws inside the table
#mean -> the mean value of column 
#min -> the minimum value of column
# 50% -> it is also known as median of the data

              OS        DBMS
count   6.000000    6.000000
mean   87.083333   75.333333
std    12.523644   15.422927
min    64.000000   60.000000
25%    85.125000   63.500000
50%    90.250000   72.000000
75%    95.000000   83.500000
max    98.000000  100.000000

In [151]:
df1.T  # It will transpose the data frame

SyntaxError: invalid syntax (<ipython-input-151-855258c73203>, line 1)

In [153]:
df1.describe()

              OS        DBMS
count   6.000000    6.000000
mean   87.083333   75.333333
std    12.523644   15.422927
min    64.000000   60.000000
25%    85.125000   63.500000
50%    90.250000   72.000000
75%    95.000000   83.500000
max    98.000000  100.000000

In [ ]:
T   #<- it will transpose the table (Rows will become columns and columns will become rows)

In [121]:
df1.T   #<- it will not change in the real data becoz it is temporary data

          1       2      3      4      5      6
Name  Rohit  Venkat  Sahil  Steve  Robby  Peter
OS     85.0    64.0   98.0   95.0   85.5   98.5
DBMS     60      76     62     86     68     76

In [125]:
df1

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [123]:
df1.iloc[1]

Name    Venkat
OS        64.0
DBMS        76
Name: 2, dtype: object

In [154]:
asd =df1.T

In [155]:
asd

          1       2      3      4      5          6
Name  Rohit  Venkat  Sahil  Steve  Robby  Spiderman
OS     85.0    64.0   98.0   95.0   85.5       95.0
DBMS     60      76     62     86     68        100

In [127]:
asd.iloc[1]

1    85.0
2    64.0
3    98.0
4    95.0
5    85.5
6    98.5
Name: OS, dtype: object

In [128]:
asd

          1       2      3      4      5      6
Name  Rohit  Venkat  Sahil  Steve  Robby  Peter
OS     85.0    64.0   98.0   95.0   85.5   98.5
DBMS     60      76     62     86     68     76

In [ ]:
sum()   #<- it will add  the values of every column partially and also it will concatinate all the strings

In [131]:
df1

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [156]:
df1.sum()  #<- it will give the total sum of OS column values

Name    RohitVenkatSahilSteveRobbySpiderman
OS                                    522.5
DBMS                                    452
dtype: object

In [157]:
df1["OS"].sum()  #<- it will do sum of OS column

522.5

In [132]:
df1

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [167]:
df1.sum(1)  #  1 -> axis   <- it means it will take the valus of every rows 
#<- it will do sum of every rows by default same data type

1    145.0
2    140.0
3    160.0
4    181.0
5    153.5
6    195.0
dtype: float64

In [168]:
df1.sum(0)    # axis = 0 for columns
#<- it will some the values by column of same values by default

Name    RohitVenkatSahilSteveRobbySpiderman
OS                                    522.5
DBMS                                    452
dtype: object

In [136]:
mean() <- It will return the average of all values of columns and it will ignore strings

In [169]:
df1.mean()   #mean of column values

OS      87.083333
DBMS    75.333333
dtype: float64

In [170]:
df1.mean(1)   #axis -> 1  it means rows
# it will give the mean value of every rows

1    72.50
2    70.00
3    80.00
4    90.50
5    76.75
6    97.50
dtype: float64

In [141]:
df1

     Name    OS  DBMS
1   Rohit  85.0    60
2  Venkat  64.0    76
3   Sahil  98.0    62
4   Steve  95.0    86
5   Robby  85.5    68
6   Peter  98.5    76

In [ ]:
median()  #<- it will sort all the values in ascending order and return the middle number

In [139]:
df1.median()   #<- it will ignore the string column and return the median from evry columns
#if no. of values in column are even , then median will be (n/2 + n+1/2)/2 . here n is the value of mid number and n+1 is the next sorted value in in column

OS      90.25
DBMS    72.00
dtype: float64

In [140]:
df1.median(1)  #<- it will take the median value from every rows

1    72.50
2    70.00
3    80.00
4    90.50
5    76.75
6    87.25
dtype: float64

In [ ]:
mode()  #<- it will print all the datas in ascending order

In [176]:
df1

        Name    OS  DBMS
1      Rohit  85.0    60
2     Venkat  64.0    76
3      Sahil  98.0    62
4      Steve  95.0    86
5      Robby  85.5    68
6  Spiderman  95.0   100

In [177]:
df1.mode()  #<- every column values will be converted in ascending order

        Name    OS  DBMS
0      Robby  95.0    60
1      Rohit   NaN    62
2      Sahil   NaN    68
3  Spiderman   NaN    76
4      Steve   NaN    86
5     Venkat   NaN   100

In [178]:
df1.mode(1)  #It will give all the row values in descending order and it also takes the string's first alphabet as its ascii value and return the table

c:\users\hello\appdata\local\programs\python\python39\lib\site-packages\pandas\core\algorithms.py:944: UserWarning: Unable to sort modes: '<' not supported between instances of 'str' and 'float'
  warn(f"Unable to sort modes: {err}")
c:\users\hello\appdata\local\programs\python\python39\lib\site-packages\pandas\core\algorithms.py:944: UserWarning: Unable to sort modes: '<' not supported between instances of 'str' and 'int'
  warn(f"Unable to sort modes: {err}")
c:\users\hello\appdata\local\programs\python\python39\lib\site-packages\pandas\core\algorithms.py:944: UserWarning: Unable to sort modes: '<' not supported between instances of 'int' and 'str'
  warn(f"Unable to sort modes: {err}")

       0          1       2
1   85.0      Rohit      60
2   64.0         76  Venkat
3     62      Sahil    98.0
4  Steve         86    95.0
5     68       85.5   Robby
6    100  Spiderman    95.0

In [179]:
ord("R")

82

In [180]:
chr(82)

'R'

In [181]:
ord("A")

65

In [184]:
chr(90)

'Z'

In [ ]:
std #<- Standard deviation

In [146]:
df1.std()

OS      13.037126
DBMS     9.852242
dtype: float64

In [147]:
df1.std(1)  #it will give the standard deviation of every rows values

1    17.677670
2     8.485281
3    25.455844
4     6.363961
5    12.374369
6    15.909903
dtype: float64

In [ ]:
min & max

In [186]:
df1.min()  #it will give the min value from every columns and also it gives min string value from its ascii value

Name    Robby
OS       64.0
DBMS       60
dtype: object

In [187]:
df1.max() # it gives the max value from every rows and also same for string from its ascii values

Name    Venkat
OS        98.0
DBMS       100
dtype: object

In [188]:
df1.min(1)  #<- it will give the min value from every rows and it will not include string from ascii valuee

1    60.0
2    64.0
3    62.0
4    86.0
5    68.0
6    95.0
dtype: float64

In [152]:
df1.max(1)  #<- it will give the max value from every rows but it will not print compare string with numbers, so it prints the max values between the numbers in the rows

1    85.0
2    76.0
3    98.0
4    95.0
5    85.5
6    98.5
dtype: float64

In [ ]:
cumsum()

In [189]:
df1.cumsum()  #<- it will add all the column values in line by line and also printing it

                                  Name     OS  DBMS
1                                Rohit   85.0    60
2                          RohitVenkat  149.0   136
3                     RohitVenkatSahil  247.0   198
4                RohitVenkatSahilSteve  342.0   284
5           RohitVenkatSahilSteveRobby  427.5   352
6  RohitVenkatSahilSteveRobbySpiderman  522.5   452

In [194]:
df1[["OS"]].sum()

OS    522.5
dtype: float64

In [156]:
df1.cumsum(1)  #<- you can not use cumsum method in  row because there is a string and float both

TypeError: can only concatenate str (not "float") to str

In [16]:
%autosave 120

Autosaving every 120 seconds